config/config_quick_test.yaml
# NFS Performance Quick Test Configuration
# Designed to complete in approximately 15 minutes
# Reduced file sizes and shorter runtimes for rapid validation

# DD Test Configuration
dd_tests:
  enabled: true
  
  sequential_write_direct:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: true
      sync: false
  
  sequential_write_sync:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: false
      sync: true
  
  sequential_read_direct:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: true
  
  sequential_read_cached:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: false

# IOzone Test Configuration (Quick Test Profile)
iozone_tests:
  enabled: true
  
  baseline_throughput:
    enabled: true
    file_size: "1g"              # Reduced from 4g
    record_size: "1m"
    test_types: [0, 1]
    direct_io: true
    include_close: true
  
  cache_behavior:
    enabled: true
    file_size: "500m"            # Reduced from 2g
    record_size: "1m"
    test_types: [0, 1]           # 0=write to create file, 1=read for cache test
    direct_io: false
  
  random_io_4k:
    enabled: true
    file_size: "8m"            # Reduced from 1g
    record_size: "4k"
    test_types: [0, 2, 4]        # 0=write to create file, 2=random read, 4=random write
    direct_io: true
  
  concurrency_16_threads:
    enabled: true
    file_size: "256m"            # Reduced from 1g
    record_size: "1m"
    threads: 8                   # Reduced from 16
    test_types: [0, 1]
    direct_io: true
    throughput_mode: true
  
  metadata_operations:
    enabled: true
    file_size: "32m"             # Reduced from 64m
    record_size: "4k"
    threads: 16                  # Reduced from 32
    test_types: [0, 1]
    direct_io: false
    throughput_mode: true
  
  scaling_test:
    enabled: true
    thread_counts: [4, 8]        # Reduced from [4, 8, 16, 32]
    file_size: "256m"            # Reduced from 512m
    record_size: "1m"
    test_types: [0, 1]
    direct_io: true
    throughput_mode: true
  
  mixed_workload:
    enabled: true
    file_size: "512m"            # Reduced from 2g
    record_size: "128k"
    threads: 4                   # Reduced from 8
    test_types: [0, 1, 2, 4]
    direct_io: true
    throughput_mode: true

# FIO Test Configuration
fio_tests:
  enabled: true
  
  common:
    output_format: "json"
    time_based: true
    group_reporting: true
  
  sequential_write:
    enabled: true
    rw: "write"
    bs: "1M"
    size: "1G"                # Reduced from 4G
    numjobs: 1
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 30               # 30 seconds
  
  sequential_read:
    enabled: true
    rw: "read"
    bs: "1M"
    size: "1G"                # Reduced from 4G
    numjobs: 2                # Reduced from 4
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 30               # 30 seconds
  
  random_read_4k:
    enabled: true
    rw: "randread"
    bs: "4k"
    size: "500M"              # Reduced from 2G
    numjobs: 2                # Reduced from 4
    ioengine: "libaio"
    iodepth: 32
    direct: 1
    runtime: 60               # 1 minute
    randrepeat: 0
  
  random_write_4k:
    enabled: true
    rw: "randwrite"
    bs: "4k"
    size: "500M"              # Reduced from 2G
    numjobs: 2                # Reduced from 4
    ioengine: "libaio"
    iodepth: 32
    direct: 1
    runtime: 60               # 1 minute
    randrepeat: 0
  
  mixed_randrw_70_30:
    enabled: true
    rw: "randrw"
    rwmixread: 70
    bs: "8k"
    size: "500M"              # Reduced from 2G
    numjobs: 4                # Reduced from 8
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 60               # 1 minute
    randrepeat: 0
  
  metadata_operations:
    enabled: true
    rw: "write"
    bs: "4k"
    filesize: "1M"
    nrfiles: 1000             # Reduced from 5000
    numjobs: 4                # Reduced from 8
    ioengine: "sync"
    create_on_open: 1
    runtime: 60               # 1 minute
  
  latency_test:
    enabled: true
    rw: "randread"
    bs: "4k"
    size: "500M"              # Reduced from 1G
    numjobs: 1
    ioengine: "libaio"
    iodepth: 1
    direct: 1
    runtime: 30               # 30 seconds
    lat_percentiles: 1

# Bonnie++ Test Configuration (Quick Test Profile)
bonnie_tests:
  enabled: true
  
  comprehensive_test:
    enabled: false               # Disabled for quick test
  
  fast_test:
    enabled: true
    file_size: "2g"              # Reduced from 4g
    ram_size: "1024"             # Tell bonnie++ to assume 1GB RAM to avoid size warning
    num_files: "4:0:0:4"         # Reduced files
    fast_mode: true
    timeout: 900                 # 15 minutes
  
  file_operations:
    enabled: true
    file_size: "1g"              # Reduced from 2g
    ram_size: "512"              # Tell bonnie++ to assume 512MB RAM
    num_files: "16:0:0:16"       # Reduced files
    # processes: 2               # Disabled - causes issues with CSV output in some bonnie++ versions
# dbench Test Configuration (Quick Test Profile)
# Estimated time: ~2-3 minutes
dbench_tests:
  enabled: true
  
  common:
    directory: "dbench_test"
    warmup: 5                     # Shorter warmup
    machine_readable: true
    skip_cleanup: false
    fsync: false
    sync_dirs: false
  
  light_client_load:
    enabled: true
    num_clients: 2
    duration: 60                  # 1 minute (reduced)
    loadfile: "nfs_3.load"
    target_rate: 0
  
  moderate_client_load:
    enabled: true
    num_clients: 4                # Reduced from 8
    duration: 90                  # 1.5 minutes (reduced)
    loadfile: "nfs_3.load"
    target_rate: 0
  
  heavy_client_load:
    enabled: true
    num_clients: 8                # Reduced from 16
    duration: 60                  # 1 minute (reduced from 4 minutes)
    loadfile: "nfs_3.load"
    target_rate: 0
  
  scalability_test:
    enabled: true
    client_counts: [1, 2, 4]      # Reduced from [1, 2, 4, 8, 16, 32]
    duration_per_count: 30        # 30 seconds per count (reduced from 120)
    loadfile: "nfs_3.load"
    target_rate: 0
  
  latency_test:
    enabled: true
    num_clients: 1
    duration: 60                  # 1 minute (reduced)
    loadfile: "nfs_3.load"
    # Note: fsync and sync_dirs not supported by dbench 5.0
    target_rate: 0
  
  sustained_load:
    enabled: true
    num_clients: 4                # Reduced from 12
    duration: 120                 # 2 minutes (reduced from 10 minutes)
    loadfile: "nfs_3.load"
    target_rate: 0
    warmup: 10                    # Reduced warmup
  
  rate_limited_test:
    enabled: true
    num_clients: 4                # Reduced from 8
    duration: 60                  # 1 minute (reduced from 3 minutes)
    loadfile: "nfs_3.load"
    target_rate: 25               # 25 MB/s (reduced from 50)
  
  metadata_intensive:
    enabled: true
    num_clients: 8                # Reduced from 16
    duration: 60                  # 1 minute (reduced from 3 minutes)
    loadfile: "nfs_3.load"
    target_rate: 0

    timeout: 600                 # 10 minutes

# Test Execution Options
execution:
  stop_on_error: false
  cleanup_on_completion: true
  verbose: false

# Output Options
output:
  json_enabled: true
  log_enabled: true
  console_summary: true

# Performance Baselines (for reference)
baselines:
  network_10gbe:
    sequential_read_mbps: [900, 1150]
    sequential_write_mbps: [700, 1000]
    random_read_iops: [20000, 40000]
    random_write_iops: [15000, 30000]
    latency_avg_ms: [1, 2]

# Quick Test Profile
# Estimated completion time: ~15 minutes
# Total DD data: 20GB (4 tests × 5GB each)
# Total FIO runtime: ~5.5 minutes (330 seconds)

# Made with Bob